{
  "UserId": 1347386571,
  "FirstName": "محمدصادق",
  "LastName": "شاد",
  "Email": "sadegh@codebase.ir",
  "Position": "صاحب امتیاز کدبیس، برنامه‌نویس، توسعه‌دهنده وب",
  "Biography": "<p class=\"intro no-top-margin\">
        سلام. من محمدصادق شاد هستم. متولد 19 دی 69، ساکن شهرستان قوچان و 
		فارغ التحصیل رشته مهندسی نرم افزار در مقطع کارشناسیم.
		خیلی وقتا شده که از کارم زده میشم اما با مشورت با بقیه متوجه شدم که این مشکل تنها واسه
		من پیش نمیاد. کارمو خیلی دوست دارم. همیشه دنبال مطالب جدید توی زمینه فعالیتم هستم.
    </p>
    <h2>سوابق...</h2>
    <p>
        متاسفانه شرایط موجود و کم کاری خودم باعث شده تا همین چند وقت پیش در قالب یک فریلنسر کار کنم.
        ولی از حدود 6 ماه پیش بصورت موقتی بعنوان برنامه‌نویس به مجموعه کامپیوتر دانشگاه آزاد اسلامی، واحد قوچان اضافه شدم.
        این که آیا واقعا اونجا مسمر ثمر بودم یا نه مهم نیست، اما شخصا تجارب بسیاری رو تو این مدت کسب کردم که
        جای بسی خوشحالی داره. :)
    </p>
    <h2>توانایی هام...</h2>
    <p>
        هر چند انجام پروژه های تحت ویندوز هم همیشه واسم لذت بخش بوده، اما انتخاب اولم توسعه برنامه های تحت وب بدلیل
		گرایش هر چه بیشتر به این سمت هستش. توی این مسیر از تکنولوژی‌ها، ابزارها و کتابخوانه های زیادی برای
		به سرانجام رسوندن پروژه هام استفاده کردم. بعنوان مثال 3 سالی میشه که کاملا سوئیچ کردم روی ASP.NET MVC
		و کمتر شده برم سمت ASP.NET Webforms؛
		مگر اینکه شرایط اجازه اینکارو نده.
    </p>
    <h2>چه مسیریو طی کردم تا...</h2>
    <p>
        اولش با VB6 شروع کردم که خیلی زود هم گذاشتمش کنار. بعد یه مدتی با VB.NET کار کردم.
        اونم بعد یه مدت  دیدم فایده نداره. چون منابعش توی اینترنت نسبت به داداش کوچیکش یعنی C#.NET خیلی کمتره.
        این شد که از اون موقع تا همین الان C#.NET شد زبان برنامه نویسی مورد علاقه‌ی من.
    </p>
    <p>
        همین مسیر برای رسیدن به ASP.NET MVC هم واسم طی شده! در ابتدا یخورده کوچولو با ASP کار کردم.
        بعدش رفتم سراغ ASP.NET و حدود 2 سال هم کارم شده بود فقط ASP.NET.
        اما در نهایت از 3 سال پیش بود که با ASP.NET MVC آشنا شدم و به ضرس قاطع میگم که یکی از بهترین انتخابام بوده!
    </p>
    <p>
        شانس باهام یار بوده که این موضوع تو زمینه DBMSها واسم پیش نیومده! (البته شاید هم برعکس)
        از همون ابتدا به غیر از Microsoft SQL Server با هیچ DBMS دیگه ای کار نکردم.
        هر چند از دو سه سال پیش که LINQ و مشتقاتش به NET Framework. اضافه شد و جاشو بیشتر و بیشتر بین برنامه نویسای NET. باز کرد، منو MsSql خیلی کمتر باهم فیس تو فیس شدیم!
    </p>
    <p>
        یکی از ORMهای مورد علاقم NHibernate هستش که شدیدا مثل ASP.NET MVC، روی این مورد هم تعصب دارم.
        هر چند همزمان با EntityFramework هم سرو کله زدم.
        (بین خودمون باشه توی نسخ آخر قابلیت هایی بهش اضافه شده که باعث شده تو یکی دوتا پروژه، DAL رو با EF پیاده سازی کنیم.)
    </p>"
}